{
    "notifications": [
        {
            "title": "Redis 8.0-M02 released – the fastest Redis ever",
            "body": "The second milestone of Redis 8 is our most advanced and performant offering yet, available for you to try in Community Edition (CE) today. <p> It introduces major performance improvements -  the latency of many commonly used Redis commands has been significantly reduced. For example, up to 36% reduction in latency for ZADD, up to 28% for SMEMBERS, and up to 10% for HGETALL—compared to Redis 7.2.5. <p> Check out the <a href=\"https://redis.io/blog/redis-8-0-m02-the-fastest-redis-ever/?utm_source=redisinsight&utm_medium=main&utm_campaign=notification\" target=\"_blank\">blog post</a> for more details. <p> Get it from <a href=\"https://hub.docker.com/_/redis/tags\" target=\"_blank\">Docker</a>.",
            "category": "release",
            "categoryColor": "#805A0D",
            "timestamp": 1730815814
        },
        {
            "title": "Connect to Redis from Visual Studio Code",
            "body": "Redis for VS Code brings the power of Redis directly into your favorite code editor! <p> Connect to your Redis databases from within Microsoft Visual Studio Code and enjoy the streamlined experience you already love in Redis Insight.  <p> Download Redis for VS Code from <a href=\"https://marketplace.visualstudio.com/items?itemName=Redis.redis-for-vscode\" target=\"_blank\">Visual Studio Marketplace</a>.",
            "category": "release",
            "categoryColor": "#805A0D",
            "timestamp": 1729158813
        },
        {
            "title": "Security Advisory: CVE-2024-31449, CVE-2024-31227, CVE-2024-31228",
            "body": "Recently, three Redis security vulnerabilities were found. If you’re using Redis Cloud, no action is needed as it’s already updated. For self-managed Redis (Software or Community versions), please upgrade promptly. <p> Learn more in our <a href=\"https://redis.io/blog/security-advisory-cve-2024-31449-cve-2024-31227-cve-2024-31228/?utm_source=redisinsight&utm_medium=main&utm_campaign=notification\" target=\"_blank\">blog post</a> on how to protect your instance.",
            "category": "security",
            "categoryColor": "#800D0D",
            "timestamp": 1729065451
        }
    ]
}
